zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_DOUT23_20 Bits */
/* GPIO_DOUT23_20[DIO20] Bits */
#define GPIO_DOUT23_20_DIO20_OFS                 (0)                             /* !< DIO20 Offset */
#define GPIO_DOUT23_20_DIO20_MASK                ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO20 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT23_20_DIO20_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT23_20_DIO20_ONE                 ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIO_DOUT23_20[DIO21] Bits */
#define GPIO_DOUT23_20_DIO21_OFS                 (8)                             /* !< DIO21 Offset */
#define GPIO_DOUT23_20_DIO21_MASK                ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO21 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT23_20_DIO21_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT23_20_DIO21_ONE                 ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIO_DOUT23_20[DIO22] Bits */
#define GPIO_DOUT23_20_DIO22_OFS                 (16)                            /* !< DIO22 Offset */
#define GPIO_DOUT23_20_DIO22_MASK                ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO22 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT23_20_DIO22_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT23_20_DIO22_ONE                 ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIO_DOUT23_20[DIO23] Bits */
#define GPIO_DOUT23_20_DIO23_OFS                 (24)                            /* !< DIO23 Offset */
#define GPIO_DOUT23_20_DIO23_MASK                ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO23 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT23_20_DIO23_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT23_20_DIO23_ONE                 ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

/* GPIO_DOUT27_24 Bits */
/* GPIO_DOUT27_24[DIO24] Bits */
#define GPIO_DOUT27_24_DIO24_OFS                 (0)                             /* !< DIO24 Offset */
#define GPIO_DOUT27_24_DIO24_MASK                ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO24 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT27_24_DIO24_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT27_24_DIO24_ONE                 ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIO_DOUT27_24[DIO25] Bits */
#define GPIO_DOUT27_24_DIO25_OFS                 (8)                             /* !< DIO25 Offset */
#define GPIO_DOUT27_24_DIO25_MASK                ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO25 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT27_24_DIO25_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT27_24_DIO25_ONE                 ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIO_DOUT27_24[DIO26] Bits */
#define GPIO_DOUT27_24_DIO26_OFS                 (16)                            /* !< DIO26 Offset */
#define GPIO_DOUT27_24_DIO26_MASK                ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO26 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT27_24_DIO26_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT27_24_DIO26_ONE                 ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIO_DOUT27_24[DIO27] Bits */
#define GPIO_DOUT27_24_DIO27_OFS                 (24)                            /* !< DIO27 Offset */
#define GPIO_DOUT27_24_DIO27_MASK                ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO27 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT27_24_DIO27_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT27_24_DIO27_ONE                 ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

/* GPIO_DOUT31_28 Bits */
/* GPIO_DOUT31_28[DIO28] Bits */
#define GPIO_DOUT31_28_DIO28_OFS                 (0)                             /* !< DIO28 Offset */
#define GPIO_DOUT31_28_DIO28_MASK                ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO28 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT31_28_DIO28_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT31_28_DIO28_ONE                 ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIO_DOUT31_28[DIO29] Bits */
#define GPIO_DOUT31_28_DIO29_OFS                 (8)                             /* !< DIO29 Offset */
#define GPIO_DOUT31_28_DIO29_MASK                ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO29 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT31_28_DIO29_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT31_28_DIO29_ONE                 ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIO_DOUT31_28[DIO30] Bits */
#define GPIO_DOUT31_28_DIO30_OFS                 (16)                            /* !< DIO30 Offset */
#define GPIO_DOUT31_28_DIO30_MASK                ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO30 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT31_28_DIO30_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT31_28_DIO30_ONE                 ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIO_DOUT31_28[DIO31] Bits */
#define GPIO_DOUT31_28_DIO31_OFS                 (24)                            /* !< DIO31 Offset */
#define GPIO_DOUT31_28_DIO31_MASK                ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO31 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT31_28_DIO31_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT31_28_DIO31_ONE                 ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

